Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Avoiding BlockInput also avoids the need to work around sticking keys as described in the next paragraph.
ja: BlockInputを避けることで、次の段落で説明するスティッキングキーを回避することもできます。

source: Avoids displaying column headers in report view.
ja: レポートビューで列ヘッダを表示しない。

source: Avoids starting a new thread each time Function is called.
ja: Functionが呼び出されるたびに新しいスレッドを開始するのを避けることができます。

source: B = Bytes
ja: B = バイト

source: Back
ja: 戻る

source: Background Information
ja: 背景情報

source: BackgroundTrans might not work properly for controls inside a Tab control that contains a ListView.
ja: ListViewを含むTabコントロール内のコントロールで、BackgroundTransが正しく動作しない場合がある。

source: Backspace (or BS)
ja: Backspace（またはBS）

source: Bailing Out
ja: ベイルアウト

source: Base Executable File
ja: 基本実行ファイル

source: Base objects can be defined two different ways:
ja: ベース・オブジェクトは2つの異なる方法で定義できる：

source: Based on the v1 script by Jon
ja: Jonのv1スクリプトに基づく

source: Based on the v1 script by Jonny
ja: Jonnyのv1スクリプトに基づく

source: Based on the v1 script by Phi
ja: Phiのv1スクリプトに基づく

source: Based on the v1 script by Rajat
ja: Rajatのv1スクリプトに基づく

source: Based on the v1 script by Savage
ja: Savageのv1スクリプトに基づく

source: Based on the v1 script by deguix
ja: deguixのv1スクリプトに基づく

source: Based on the v1 script by numEric
ja: numEricのv1スクリプトに基づく

source: Basic Hotkeys
ja: 基本的なホットキー

source: Basic Operation
ja: 基本操作

source: Basic Usage
ja: 基本的な使い方

source: Basic usage.
ja: 基本的な使い方です。

source: Be aware that selecting a v1 exe will make it difficult to run any of the support scripts, except via the "AutoHotkey" shortcut in the Start menu.
ja: v1 exeを選択すると、スタートメニューの「AutoHotkey」ショートカットを使用する以外、サポートスクリプトを実行することが難しくなりますのでご注意ください。

source: Be kind.
ja: 親切にしなさい。

source: Be open.
ja: オープンであれ。

source: Be patient.
ja: 忍耐強くあれ。

source: Be polite.
ja: 礼儀正しくあれ。

source: Be sure to include the .lnk extension.
ja: 必ず拡張子.lnkを付けてください。

source: Be sure to save the file as UTF-8 with BOM if it will contain non-ASCII characters.
ja: ASCII以外の文字が含まれる場合は、必ずBOM付きのUTF-8として保存してください。

source: Because Prototype is implicitly defined in each class, static Prototype.sharedValue := 1 can be used to set values which are dynamically inherited by all instances of the class (until shadowed by a property on the instance itself).
ja: Prototypeは各クラスで暗黙的に定義されているため、static Prototype.sharedValue := 1を使用すると、クラスのすべてのインスタンスに動的に継承される値を設定できます（インスタンス自体のプロパティによってシャドウされるまで）。

source: Because AutoHotkey is not a console program, errors will not appear at the command prompt directly.
ja: AutoHotkeyはコンソールプログラムではないので、コマンドプロンプトに直接エラーが表示されることはありません。

source: Because UIA programs run at a different "integrity level" than other programs, they can only access objects registered by other UIA programs.
ja: UIAプログラムは他のプログラムとは異なる「完全性レベル」で実行されるため、他のUIAプログラムによって登録されたオブジェクトにしかアクセスできない。

source: Because all references to an object must be released before the object can be freed, objects containing circular references aren't freed automatically.
ja: オブジェクトを解放する前に、オブジェクトへの参照をすべて解放しなければならないので、循環参照を含むオブジェクトは自動的に解放されない。

source: Because both remappings allow additional modifier keys to be held down, the more specific +CapsLock::CapsLock remapping must be placed first for it to work.
ja: どちらのリマッピングも修飾キーを押したままにできるため、より特殊な+CapsLock::CapsLockリマッピングを最初に配置しなければ動作しない。

source: Because each keystroke or mouse click consists of a down-event and an up-event, KeyHistory displays only half as many "complete events" as specified by MaxEvents.
ja: キーストロークやマウスクリックはダウンイベントとアップイベントで構成されているため、KeyHistoryはMaxEventsで指定された数の半分の「完全なイベント」しか表示しません。

source: Because it is VT_VARIANT in this case, it can be freed by calling VariantClear with DllCall or by using a simpler method:
ja: この場合VT_VARIANTなので、DllCallで VariantClearを呼び出すか、もっと簡単な方法で解放することができます。

source: Because it is VT_VARIANT in this case, it can be freed by calling VariantClear with DllCall or by using a simpler method: assign an integer, such as vref[] := 0.
ja: この場合VT_VARIANTなので、DllCallで VariantClearを呼び出すか、もっと簡単な方法で解放することができます：vref[] := 0のように整数を代入します。

source: Because of this and the fact that there is no way to determine whether a drive is currently locked, it is often useful to keep track of its lock-state in a variable.
ja: このため、ドライブが現在ロックされているかどうかを判断する方法がないため、そのロック状態を変数に記録しておくと便利な場合があります。

source: Because of this behavior, it's important to realize that any side-effects produced by a function (such as altering a global variable's contents) might never occur if that function is called on the right side of an AND or OR.
ja: このため、ある関数がANDや ORの右辺で呼び出された場合、その関数が生み出す副作用（グローバル変数の内容の変更など）が発生しない可能性があることを認識しておくことが重要です。

source: Because of this behavior, only tabs at the end should generally be removed.
ja: この動作のため、一般的には末尾のタブのみを削除する必要があります。

source: Because of this, an OnExit function should be designed to finish quickly unless the user is aware of what it is doing.
ja: このため、OnExit関数は、ユーザーが何をしているのかを意識しない限り、すぐに終了するように設計する必要があります。

source: Because of this, it is usually best to design high priority threads to finish quickly, or use Critical instead of making them high priority.
ja: このため、通常は優先順位の高いスレッドを素早く終了するように設計するか、優先順位を高くする代わりにクリティカルを使用するのが最善である。

source: Because of this, the function starts off fresh with the default values for settings such as SendMode and DetectHiddenWindows.
ja: このため、SendModeや DetectHiddenWindowsなどの設定値はデフォルトのまま、関数は新たにスタートします。

source: Because the class itself is accessed through a variable, the class name cannot be used to both reference the class and create a separate variable (such as to hold an instance of the class) in the same context.
ja: クラス自体は変数を通してアクセスされるため、クラス名を使用してクラスを参照し、同じコンテキストで別の変数（クラスのインスタンスを保持するなど）を作成することはできません。

source: Because the function has been called, parameters, A_ThisFunc and closures are available (they previously were not).
ja: 関数が呼び出されたので、パラメータ、A_ThisFunc、クロージャが利用できるようになりました（以前は利用できませんでした）。

source: Because the items in MatchList are not treated as individual parameters, the list can be contained entirely within a variable.
ja: MatchListの項目は個々のパラメータとして扱われないため、リストをすべて変数に格納することができます。

source: Because the pseudo-array is only conceptual and not a single value, it can't be passed to or returned from a function, or copied as a whole.
ja: 疑似配列は概念的なものでしかなく、1つの値ではないため、関数に渡したり返したり、全体としてコピーすることはできません。

source: Because the system tick count generally has a granularity of 15.6 milliseconds, the minimum delta value is generally at least 15 or 16.
ja: システムティックカウントは一般的に15.6ミリ秒の粒度を持つため、デルタ値の最小値は一般的に少なくとも15または16となる。

source: Because the words local, global, and static are processed immediately when the script launches, a variable cannot be conditionally declared by means of an IF statement.
ja: スクリプトの起動時にlocal、global、staticという言葉が即座に処理されるため、IF文によって変数を条件付きで宣言することができない。

source: Because they are intended for use with prefix keys that are not normally used as such, custom combinations have the following special behavior:
ja: カスタムコンビネーションは、通常使用されないプレフィックスキーでの使用を想定しているため、以下のような特殊な動作をします：

source: Because timers operate by temporarily interrupting the script's current activity, their functions should be kept short (so that they finish quickly) whenever a long interruption would be undesirable.
ja: タイマーは、スクリプトの現在の活動を一時的に中断することで動作するため、長い中断が望ましくない場合は、タイマーの機能を短く保つ（すぐに終了するようにする）必要があります。

source: Before HotIf is used in a hotkey or hotstring thread, the Hotkey and Hotstring functions default to the same context as the hotkey or hotstring that launched the thread.
ja: HotIfがホットキーまたはホットストリングスレッドで使用される前に、ホットキーおよびホットストリング関数は、スレッドを起動したホットキーまたはホットストリングと同じコンテキストにデフォルト設定されます。

source: Before learning to use AutoHotkey (AHK), you will need to download it.
ja: AutoHotkey（AHK）の使い方を学ぶ前に、ダウンロードする必要があります。

source: Before performing a double reference, the name of the target variable is stored in a second variable.
ja: 二重参照を行う前に、対象となる変数名を第二の変数に格納します。

source: Before the Hotkey function is used to modify an existing hotkey variant, typically the HotIf function must be used with the original expression text.
ja: Hotkey関数を使用して既存のホットキーバリアントを変更する前に、通常、HotIf関数を元の表現テキストで使用する必要があります。

source: Before the loop begins, Expression is evaluated to determine the target object.
ja: ループが始まる前に、Expressionが評価され、ターゲットオブジェクトが決定されます。

source: Before the script starts to run, display a warning for each undeclared local variable which has the same name as a global variable.
ja: スクリプトの実行前に、グローバル変数と同じ名前の未宣言のローカル変数に対して警告を表示するようにします。

source: Before the script starts to run, display a warning for the first reference to each variable which is never used in any of the following ways:
ja: スクリプトの実行を開始する前に、次のいずれにも使用されることのない各変数の最初の参照に対して警告を表示します。

source: Before the script starts to run, show a warning for each line that immediately follows a Return, Break, Continue, Throw or Goto at the same nesting level, unless that line is the target of a label.
ja: スクリプトの実行を開始する前に、同じネスティングレベルのReturn、Break、Continue、Throw、Gotoの直後の各行について、その行がラベルの対象でない限り、警告を表示するようにします。

source: Before using the scan code with a built-in function like Hotkey or GetKeyState, it must first be converted to hexadecimal format, such as by using Format("sc{:X}", sc_code).
ja: Hotkeyや GetKeyStateなどの内蔵機能でスキャンコードを使用する前に、Format("sc{:X}", sc_code)などで16進数形式に変換しておく必要があります。

source: Before using the virtual key code with a built-in function like Hotkey or GetKeyState, it must first be converted to hexadecimal format, such as by using Format("vk{:X}", vk_code).
ja: Hotkeyや GetKeyStateなどの組み込み関数で仮想キーコードを使用する前に、Format("vk{:X}", vk_code)などで16進数形式に変換しておく必要があります。

source: Before we begin our journey, let me give some advice.
ja: 旅を始める前に、いくつかアドバイスをさせてほしい。

source: Before you ask, try doing some research yourself or try to code it yourself.
ja: 質問する前に、自分で調べてみるか、自分でコーディングしてみるといい。

source: Beginner Tutorial | AutoHotkey v2
ja: 初心者チュートリアル｜AutoHotkey v2

source: Beginner tutorial by tidbit
ja: 初心者向けチュートリアル by tidbit

source: Beginning of the file.
ja: ファイルの先頭です。

source: Behavior of Critical Threads
ja: クリティカルスレッドの挙動

source: Behavior of Uninterruptible Threads
ja: 無停止スレッドの挙動

source: Behaviour is not dependent on whether the method uses return (but of course, __get and __call still need to return a value).
ja: メソッドがreturnを使うかどうかで動作が変わることはありません（もちろん、__getや__callは依然として値を返す必要がありますが）。

source: Behaviour of overflow is undefined.
ja: オーバーフロー時の動作は未定義です。

source: Below are several such words/phrases which are used frequently in relation to functions:
ja: 以下に、機能に関して頻繁に使用される単語やフレーズを紹介します：

source: Below are three approaches, starting at the simplest and ending with the most complex.
ja: 以下、最も単純なものから最も複雑なものまで、3つのアプローチを紹介する。

source: Below is a list of values for the Msg parameter of PostMessage and SendMessage.
ja: 以下は、PostMessageと SendMessageのMsgパラメータの値のリストである。

source: Below the previous control (bottom edge plus margin).
ja: 前のコントロールの下（下端＋マージン）。

source: BelowNormal (or B)
ja: BelowNormal（またはB）

source: Beneath all previous controls (maximum Y extent plus margin).
ja: 以前のすべてのコントロールの下（最大Y範囲＋マージン）。

source: Beneath all previous controls since the most recent use of the Section option.
ja: セクションオプションの直近の使用以降、以前のすべてのコントロールの下にある。

source: Besides, a continuation section is used to display the multi-line text in a more clear manner.
ja: そのほか、複数行のテキストをよりわかりやすく表示するために、コンティニュアスセクションを使用しています。

source: Binary Compatibility
ja: バイナリ互換性

source: Binary Compatibility | AutoHotkey v2
ja: バイナリ互換性｜AutoHotkey v2

source: Binary data can be returned from functions and assigned to objects.
ja: バイナリデータは、関数から返したり、オブジェクトに割り当てたりすることができます。

source: Binary operator with less than two operands.
ja: オペランドが2つ以下の二項演算子。

source: Binds parameters to the function and returns a BoundFunc object.
ja: パラメータを関数にバインドし、BoundFuncオブジェクトを返す。

source: Bitwise operators perform 64-bit integer operations.
ja: ビット演算子は、64ビット整数演算を実行します。

source: Black
ja: Black（黒）

source: Blank if A_IconFile is blank.
ja: A_IconFile が空白の場合は空白。

source: Blank unless a custom tray icon has been specified via TraySetIcon -- in which case it is the full path and name of the icon's file.
ja: TraySetIconによって カスタムトレイアイコンが指定されていない場合は空白で、その場合はアイコンのファイルのフルパスとファイル名になります。

source: Blank values are invalid.
ja: 空白の値は無効です。

source: Blind mode
ja: ブラインドモード

source: Blinks the window and its taskbar button.
ja: ウィンドウとそのタスクバーボタンを点滅させます。

source: Blinks the window's button in the taskbar.
ja: タスクバーのウィンドウのボタンを点滅させます。

source: BlockInput - Syntax & Usage | AutoHotkey v2
ja: BlockInput - 構文と使用法｜AutoHotkey v2

source: Blocks are one or more statements enclosed in braces.
ja: ブロックとは、中括弧で囲まれた1つまたは複数の文のことです。

source: Blue
ja: Blue（青）

source: Body
ja: 本体

source: Boolean expressions are subject to short-circuit evaluation (left to right) in order to enhance performance.
ja: パフォーマンスを向上させるため、論理式は短絡評価（左から右へ）の対象となる。

source: Boolean values are used to represent anything that has exactly two possible states, such as the truth of an expression.
ja: ブール値は、式の真偽など、正確に2つの可能な状態を持つものを表現するために使用されます。

source: Both Base and Exponent may contain a decimal point.
ja: 基数も指数も小数点を含むことができる。

source: Both base and exponent may contain a decimal point.
ja: 基数も 指数も小数点を含むことができる。

source: Both Alpha and Index are variables in this case, and could be replaced with virtually any sub-expression.
ja: この場合、Alphaと Indexはいずれも変数であり、事実上あらゆる部分式に置き換えることができる。

source: Both Win (LWin and RWin) are automatically blocked during a SendPlay if the keyboard hook is installed.
ja: キーボードフックがインストールされている場合、SendPlay時に両Win（LWin、RWin）は自動的にブロックされます。

source: Both WinWaitActive and WinWaitNotActive will update the Last Found Window if a matching window is active when the function begins or becomes active while the function is waiting.
ja: WinWaitActive関数とWinWaitNotActive関数は、どちらも関数の開始時に一致するウィンドウがアクティブである場合、または関数が待機している間にアクティブになった場合に、最後に見つかったウィンドウを更新します。

source: Both asterisks (*) and question marks (?) are supported as wildcards.
ja: アスタリスク（*）とクエスチョンマーク（?）は、ワイルドカードとして使用できます。

source: Both asterisks and question marks are supported as wildcards.
ja: ワイルドカードとして、アスタリスクとクエスチョンマークの両方がサポートされています。

source: Both decimal and hexadecimal strings (e.g. 0xF1) are considered to be numeric.
ja: 10進数および16進数の文字列（例えば0xF1）はいずれも数値とみなされます。

source: Both examples above can be modified to send the key repeatedly rather than merely holding it down (that is, they can mimic physically holding down a key on the keyboard).
ja: 上記のどちらの例も、単にキーを押し続けるのではなく、繰り返しキーを送るように修正することができる（つまり、キーボードのキーを物理的に押し続けることを模倣することができる）。

source: Both functions throw an exception if a problem occurs, and no longer set ErrorLevel.
ja: どちらの関数も、問題が発生すると例外をスローし、ErrorLevelを設定しなくなりました。

source: Both message boxes below show 116, because only the first character is considered.
ja: 以下のメッセージボックスはいずれも116と表示されますが、これは最初の文字しか考慮されていないためです。

source: Both methods produce literal `r`n pairs inside the Edit control.
ja: どちらの方法も、Editコントロールの中にリテラルな`r`nペアを生成します。

source: Both of these are logical-AND.
ja: どちらも論理積だ。

source: Both of these are logical-OR.
ja: どちらも論理和である。

source: Both scripts must use the same native encoding.
ja: 両方のスクリプトは同じネイティブエンコーディングを使用する必要があります。

source: Both the script invoking the object and the object itself must be running a supported AutoHotkey version.
ja: オブジェクトを呼び出すスクリプトとオブジェクト自体の両方が、サポートされているAutoHotkeyバージョンを実行している必要があります。

source: Both variables might exist at the same time, but only one is visible to each part of the script.
ja: 両方の変数が同時に存在することもありますが、スクリプトの各部分で見えるのは1つだけです。

source: Bound Functions
ja: バウンド関数

source: BoundFunc Object
ja: BoundFuncオブジェクト

source: BoundFunc objects can be called as shown in the example below.
ja: BoundFuncオブジェクトは、以下の例のように呼び出すことができる。

source: Brace ({) at the end of a line does not cause continuation if the program determines that it should be interpreted as the beginning of a block (OTB style) rather than the start of an object literal.
ja: 行末のブレース（{）は、オブジェクト・リテラルの開始ではなく、ブロックの開始（OTBスタイル）として解釈されるべきであるとプログラムが判断した場合、継続を引き起こさない。

source: Brace { at the end of a line is considered to be one-true-brace (rather than the start of an object literal) if there are no other unclosed symbols and the brace is not immediately preceded by an operator.
ja: 行末のブレース{は、他に閉じない記号がなく、ブレースの直前に演算子がない場合、（オブジェクトリテラルの開始ではなく）ワントゥルーブレースとみなされます。

source: Brace syntax
ja: ブレース構文

source: Braces are generally not required if only a single statement is used.
ja: 一般に、単一のステートメントのみを使用する場合は、中括弧は不要です。

source: Braces are used to enclose key names, virtual key codes or scan codes, similar to the Send function.
ja: 中括弧は、送信機能と同様に、キー名、仮想キーコード、スキャンコードを囲むために使用されます。

source: Bracket notation
ja: ブラケット表記

source: Bracket syntax (Array)
ja: ブラケット構文（配列）

source: Brackets are required when accessing elements; i.e. a.b refers to a property and a["b"] refers to an element.
ja: a.bはプロパティを、a["b"]は要素を意味します。

source: Break - Syntax & Usage | AutoHotkey v2
ja: Break - 構文と使用法｜AutoHotkey v2

source: Breakpoints.
ja: ブレークポイント。

source: Breaks the loop if var is greater than 25.
ja: varが 25 より大きい場合、ループを中断します。

source: Breaks the outer loop from within a nested loop.
ja: ネストしたループの中から外側のループをブレイクします。

source: Briefly displays a tooltip for each clipboard change.
ja: クリップボードの変更ごとにツールチップを短く表示します。

source: Brings the specified window to the top of the stack without explicitly activating it.
ja: 指定されたウィンドウを明示的にアクティブにすることなく、スタックの最上部に移動させることができます。

source: Btn := MyGui.Add("Button", "default xm", "OK") ; xm puts it at the bottom left corner.
ja: Btn := MyGui.Add("Button", "default xm", "OK") ; xmは左下に配置します。

source: Buffer Object
ja: Bufferオブジェクト

source: Buffer Object - Definition & Usage | AutoHotkey v2
ja: Bufferオブジェクト - 定義と使用法｜AutoHotkey v2

source: Buffer objects are typically created by calling Buffer(), but can also be returned by FileRead with the "RAW" option.
ja: Bufferオブジェクトは、通常Buffer()を呼び出して作成しますが、FileReadで「RAW」オプションを付けて返すこともできます。

source: Buffer-like Objects
ja: バッファ的オブジェクト

source: Buffered keystrokes continue to arrive in the target window after the Send function completes (even if the window is no longer active).
ja: バッファリングされたキー入力は、Send関数が完了した後も（ウィンドウがアクティブでなくなっても）ターゲットウィンドウに到着し続けます。

source: Built-in Classes
ja: 組み込みクラス

source: Built-in Classes | AutoHotkey v2
ja: 組み込みクラス｜AutoHotkey v2

source: Built-in Functions
ja: 組み込み関数でも

source: Built-in Methods for ListViews
ja: ListViewの組み込みメソッド

source: Built-in Methods for TreeViews
ja: TreeViewの組み込みメソッド

source: Built-in Objects
ja: 組込オブジェクト

source: Built-in Performance Features
ja: 内蔵パフォーマンス機能

source: Built-in Variables
ja: 組込変数

source: Built-in enumerators are instances of the Enumerator class (which is derived from Func), but any function object can potentially be used with a for-loop.
ja: 内蔵の列挙器はEnumeratorクラス（Funcから派生）のインスタンスですが、どんな関数オブジェクトでもforループで使用できる可能性があります。

source: Built-in functions are supported.
ja: 組込機能に対応しています。

source: Built-in functions such as ListVars and Pause can help you debug a script.
ja: ListVarsや Pauseなどの組み込み関数は、スクリプトのデバッグに役立ちます。

source: Built-in properties such as Base can be overridden with a property definition or DefineProp.
ja: Baseのような組み込みプロパティは、プロパティ定義またはDefinePropでオーバーライドできます。

source: Built-in variables may be used by enclosing them in percent signs (for example, #DllLoad "%A_ScriptDir%").
ja: 組み込み変数は、#DllLoad "%A_ScriptDir%"のようにパーセント記号で囲むことによって使用できます。

source: Built-in variables may be used by enclosing them in percent signs (for example, #DllLoad %A_ScriptDir%).
ja: 組込変数は、パーセント記号で囲んで使用することができます（例えば、#DllLoad %A_ScriptDir%）。

source: Built-in variables may be used by enclosing them in percent signs (for example, #Include "%A_ScriptDir%").
ja: 組込変数は、パーセント記号で囲んで使用することができます（例えば、#Include "%A_ScriptDir%"）。

source: Built-in variables such as A_Clipboard and A_TimeIdle are never local (they can be accessed from anywhere), and cannot be redeclared.
ja: A_Clipboardや A_TimeIdleなどの組み込み変数は、決してローカルではなく（どこからでもアクセス可能）、再宣言することはできません。

source: Built-in variables such as A_ScriptName.
ja: A_ScriptNameのような組み込み変数。

source: Built-in variables which return numbers now return them as an integer rather than a string.
ja: 数値を返す組み込み変数が、文字列ではなく、整数で返すようになりました。

source: Built-in variables which return special folder paths (for which long paths might be impossible anyway):
ja: 特殊なフォルダー・パス（長いパスはどのみち不可能かもしれない）を返す組み込み変数：

source: Built-in variables which return special folder paths (for which long paths might be impossible anyway): A_AppData, A_Desktop, A_MyDocuments, A_ProgramFiles, A_Programs, A_StartMenu, A_Startup and Common variants, A_Temp and A_WinDir
ja: 特殊なフォルダー・パス（長いパスはどのみち不可能かもしれない）を返す組み込み変数：A_AppData、A_Desktop、A_MyDocuments、A_ProgramFiles、A_Programs、A_StartMenu、A_StartupおよびCommonバリアント、A_Temp、A_WinDir

source: But PostMessage can get the job done:
ja: しかし、PostMessageは仕事をこなすことができる：

source: But before we get into things, we should talk about some common issues that people have.
ja: しかし、本題に入る前に、人々が抱える一般的な問題について話しておこう。

source: But before we go into that, we'll cover some basics.
ja: しかし、その前に、いくつかの基本的なことを説明します。

source: But before we go, here are some other things that I think you should know.
ja: しかし、その前に知っておくべきことがある。

source: But both (-2)**2 and (-2)**2.0 are supported.
ja: しかし、(-2)**2と(-2)**2.0の両方がサポートされている。

source: But by specifying Z, the last `n (if present) will be considered to delimit a blank item at the end of the list, and thus there are 4 items (the last being blank).
ja: しかし、Zを指定することで、最後の`n（存在する場合）はリストの最後にある空白の項目を区切るとみなされるため、4つの項目（最後の項目は空白）が存在することになります。

source: But don't be afraid to ask for help, we don't bite (hard).
ja: でも、助けを求めることを恐れないでください。私たちは（強く）噛みついたりはしません。

source: But first, you need to find the script file.
ja: しかし、その前にスクリプトファイルを探す必要があります。

source: But if less than the specified number of milliseconds have elapsed, it will assume that the user hasn't had a chance to release the keys yet and it will thus push them back down to match their physical state.
ja: しかし、指定されたミリ秒未満しか経過していない場合は、ユーザーがまだキーを離す機会がなかったと判断し、物理的な状態に合わせてキーを押し戻します。

source: But if the hotkey does not yet exist -- that is, it is about to be created by this function -- the options will default to those most recently in effect.
ja: しかし、ホットキーがまだ存在しない場合、つまりこの機能によって作成されようとしている場合、オプションは直近で有効だったものがデフォルトとなります。

source: But if you press and release the right Alt without having used it to modify another key, its hotkey action (above) will take effect immediately:
ja: しかし、他のキーの変更に使用せずに右Altを押して離すと、そのホットキーの動作（上記）が直ちに有効になります：

source: But in fact they are needed.
ja: しかし、実際には必要なのだ。

source: But in some cases you might want to specify criteria such as HWND, group or class.
ja: しかし場合によっては、HWND、グループ、クラスなどの条件を指定したいこともあるかもしれません。

source: But in this case, any value returned by the function is discarded; so unless the function produces some effect other than its return value, the call would serve no purpose.
ja: しかし、この場合、関数が返す値はすべて捨てられるので、関数がその戻り値以外の効果を生み出さない限り、この呼び出しは何の役にも立たない。

source: But now you are wondering "How can I make my really long Send functions readable?".
ja: しかし今、あなたは「どうすれば本当に長いSend関数を読みやすくできるのか？」。

source: But read on if you want to do more than just disable them all.
ja: しかし、それらをすべて無効にするだけでなくそれ以上のことをしたいのであれば、続きを読んでください。

source: But since it bypasses the normal processing of keyboard input by the system, sometimes it doesn't work.
ja: しかし、システムによるキーボード入力の通常処理をバイパスするため、うまくいかないこともあります。

source: But that depends on the version you want.
ja: しかし、それはあなたが必要とするバージョンによります。

source: But the following function will still work:
ja: しかし、次の関数はまだ機能する：

source: But there are some alternatives, try all the solutions mentioned below.
ja: しかし、いくつかの選択肢がありますので、以下に挙げるすべての解決策を試してみてください。

source: But this won't work, because by default, quote marks are used to denote the start and end of literal text.
ja: しかし、デフォルトでは、リテラルテキストの開始と終了を示すために引用符が使用されるため、これは機能しません。

source: But toolbars can be moved and hidden!
ja: しかし、ツールバーは動かしたり隠したりできる！

source: But unlike a* and a?, the pattern a+ does not match at the beginning of strings that lack an "a" character.
ja: しかし、a*や a?とは異なり、a+パターンは「a」文字のない文字列の先頭ではマッチしない。

source: But what if we want to type into an existing Notepad window?
ja: しかし、既存のメモ帳のウィンドウに入力する場合はどうでしょうか？
